%三次样条插值
%先用三次自然样条插值上半部分的型值点，再利用插值结果得到边界点的一阶导数值，用D1样条插值下半部分的型值点
clear
clc
fid = fopen('data.txt', 'r');
X = fscanf(fid, '%f', [2,93]);
fclose(fid);
X = X';
x1 = X(1:59,1);   %上半部分
y1 = X(1:59,2);
x2 = X(60:93,1);    %下半部分
y2 = X(60:93,2);
lamda1 = zeros(58,1);
miu1 = zeros(58,1);
for i=2:58
    lamda1(i) = (x1(i+1)-x1(i))/(x1(i+1)-x1(i-1));
    miu1(i) = (x1(i)-x1(i-1))/(x1(i+1)-x1(i-1));
end
D1 = sec_div_diff(x1,y1);
a1 = 2 .*ones(57,1);
c1 = lamda1(2:57,1);
d1 = miu1(3:58,1);
b1 = 6 .*D1;
M1 = zeros(59,1);
M1(1) = 0;
M1(59) = 0;
M1(2:58,1) = crout(a1,c1,d1,b1,57);
for i=1:58
    x = x1(i):0.0001:x1(i+1);
    s = y1(i)+(y1(i+1)-y1(i))/(x1(i+1)-x1(i)).*(x-x1(i))-(M1(i+1)/6+M1(i)/3)*(x1(i+1)-x1(i)).*(x-x1(i))+M1(i)/2 .*(x-x1(i)).^2+ ...,
        (M1(i+1)-M1(i))/(x1(i+1)-x1(i))/6 .*(x-x1(i)).^3;
    plot(x,s)
    hold on
end
ff1 = (y1(2)-y1(1))/(x1(2)-x1(1))-(M1(2)/6+M1(1)/3)*(x1(2)-x1(1));      %首尾两点的一阶导数值
ff59 = (y1(59)-y1(58))/(x1(59)-x1(58))-(M1(59)/6+M1(58)/3)*(x1(59)-x1(58))+M1(58)*(x1(59)-x1(58))+ ...,
    (M1(59)-M1(58))/(x1(59)-x1(58))/2*(x1(59)-x1(58))^2;
x2 = flipud(x2);    %上下翻转，使x从小到大排列
y2 = flipud(y2);
lamda2 = zeros(33,1);
miu2 = zeros(33,1);
for i=2:33
    lamda2(i) = (x2(i+1)-x2(i))/(x2(i+1)-x2(i-1));
    miu2(i) = (x2(i)-x2(i-1))/(x2(i+1)-x2(i-1));
end
D2 = sec_div_diff(x2,y2);
a2 = 2 .*ones(34,1);
c2(1,1) = 1;
c2(2:33,1) = lamda2(2:33,1);
d2(1:32,1) = miu2(2:33,1);
d2(33,1) = 1;
b2(2:33,1) = 6 .*D2;
b2(1,1) = 6*((y2(2)-y2(1))/(x2(2)-x2(1))-ff1)/(x2(2)-x2(1));
b2(34,1) = 6*(ff59-(y2(34)-y2(33))/(x2(34)-x2(33)))/(x2(34)-x2(33));
M2 = crout(a2,c2,d2,b2,34);
for i=1:33
    x = x2(i):0.0001:x2(i+1);
    s = y2(i)+(y2(i+1)-y2(i))/(x2(i+1)-x2(i)).*(x-x2(i))-(M2(i+1)/6+M2(i)/3)*(x2(i+1)-x2(i)).*(x-x2(i))+M2(i)/2 .*(x-x2(i)).^2+ ...,
        (M2(i+1)-M2(i))/(x2(i+1)-x2(i))/6 .*(x-x2(i)).^3;
    plot(x,s)
    hold on
end
hold off
title('叶片边界采样点的插值结果')